package com.it.kot.homework.lesson01.task01;
/*

1) Создать по одной переменной каждого типа данных, который ты знаешь.

2) Присвоить каждой переменной значение в диапазоне типа.

3) Вывести значение каждой переменной в консоль, каждое значение выводить с новой строки.

*/

public class Main {
    public static void main(String[] args) {
        byte b = 1;
        short s = 2;
        int i = 3;
        long l = 4l;

        boolean bool = true;

        char c = 'a';

        float f = 5.5f;
        double d = 6.5;

        System.out.println(b);
        System.out.println(s);
        System.out.println(i);
        System.out.println(l);
        System.out.println(bool);
        System.out.println(c);
        System.out.println(f);
        System.out.println(d);
    }
}
